app/views/datasets/show.html.erb

<h1><%= @dataset.database + ": " + @dataset.table %>
  <% if session[:user_id] and User.find_by(id: session[:user_id].to_i).admin %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 43]]

<ul>
  <% @dataset.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "sources" ON "posts"."id" = "sources"."post_id" WHERE "sources"."dataset_id" = ?  [["dataset_id", 1]]