app/views/users/show.html.erb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."subscriber_id" = ? AND "subscriptions"."publisher_id" = ? LIMIT 1  [["subscriber_id", 42], ["publisher_id", 41]]
---
    <% if session[:user_id] %>
      <% sub = Subscription.find_by(subscriber_id: session[:user_id].to_i, publisher_id: @user.id) %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 95]]
---
<h3>Postings:</h3>
<% if @user.posts.count > 0 %>