app/views/posts/_form.html.erb

SELECT  "datasets".* FROM "datasets"  ORDER BY database LIMIT 1
---
  <br>
  <%= form.select :sources, Dataset.all.order('database').collect {|d| [d.database + ": " + d.table, d.id]}, {}, {:multiple => true, autofocus: true} %></p>