app/views/posts/show.html.erb

	<ul>
	  <% @post.datasets.each do |dataset| %>
---
SELECT "datasets".* FROM "datasets" INNER JOIN "sources" ON "datasets"."id" = "sources"."dataset_id" WHERE "sources"."post_id" = ?  [["post_id", 1]]