app/controllers/comments_controller.rb

  def create
    c_params = params.require(:comment).permit(:post_id, :rating, :comment)
    @comment = Comment.new(c_params)
    @comment.user_id = session[:user_id]
    @comment.save
---
INSERT INTO "comments" ("post_id", "rating", "comment", "user_id") VALUES (?, ?, ?, ?)  [["post_id", 5], ["rating", 5], ["comment", "My best work ever!"], ["user_id", 15]]

  def destroy
    @comment = Comment.find_by(id: params[:id])
    post_id = @comment.post_id
    @comment.delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]