app/controllers/datasets_controller.rb

SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT 1  [["id", 34]]
---
  def find_dataset
    @dataset = Dataset.find_by(id: params[:id])

SELECT  "datasets".* FROM "datasets" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "datasets"
---
  def index
    @datasets = Dataset.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "datasets" ("database", "table", "url") VALUES (?, ?, ?)  [["database", "2"], ["table", "2"], ["url", "2"]]
---
  def create
    @dataset = Dataset.new
    @dataset.database = params[:dataset][:database]
    @dataset.table = params[:dataset][:table]
    @dataset.url = params[:dataset][:url]
    @dataset.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 43]]
---
  def edit
    if not (session[:user_id] and User.find_by(id: session[:user_id]).admin)

UPDATE "datasets" SET "database" = ? WHERE "datasets"."id" = ?  [["database", "City of Chicago Data Portal1"], ["id", 38]]
---
  def update
    @dataset.database = params[:dataset][:database]
    @dataset.table = params[:dataset][:table]
    @dataset.url = params[:dataset][:url]
    @dataset.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 43]]
DELETE FROM "datasets" WHERE "datasets"."id" = ?  [["id", 34]]
---
  def destroy
    if not (session[:user_id] and User.find_by(id: session[:user_id]).admin)
      redirect_to datasets_url(@dataset)
    end
    if @dataset
      @dataset.delete