app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "168@example.com"]]
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$hzFccoy6B9pTFNgcL.PnZusGD6ACJ8wCRBjDvSKp1WSGHnfR204NO"], ["id", 59]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)