app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_post
    @post = Post.find_by(id: params[:id])

SELECT "posts".* FROM "posts" WHERE (title LIKE '%chicago%' OR dataset.database LIKE '%chicago%' OR dataset.table LIKE '%chicago%')
SELECT COUNT(*) FROM "posts" WHERE (title LIKE ? OR content LIKE '%energy%')
SELECT  "posts".* FROM "posts" WHERE (title LIKE ? OR content LIKE '%energy%') LIMIT 10 OFFSET 0
---
  def index
    @posts = Post.all
    if params[:keyword].present?
      @posts = @posts.where("title LIKE ? OR content LIKE ?", "%#{params[:keyword]}%", "%#{params[:keyword]}%")
      if @posts.count == 0
        @posts = Post.all
      end
    end
    @posts = @posts.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "posts" ("title", "content", "image_url", "user_id") VALUES (?, ?, ?, ?)  [["title", "2"], ["content", "2"], ["image_url", "2"], ["user_id", 24]]
INSERT INTO "sources" ("post_id", "dataset_id") VALUES (?, ?)  [["post_id", 14], ["dataset_id", 10]]
---
  def create
    @post = Post.new
    @post.title = params[:post][:title]
    @post.content = params[:post][:content]
    @post.image_url = params[:post][:image_url]
    @post.user_id = session[:user_id]
    @post.save
    sources = params[:post][:sources]
    sources.each do |source|
      if source != ""
        @source = Source.new
        @source.post_id = @post.id
        @source.dataset_id = source.to_i
        @source.save

UPDATE "posts" SET "title" = ?, "content" = ?, "image_url" = ? WHERE "posts"."id" = ?  [["title", nil], ["content", nil], ["image_url", nil], ["id", 1]]
SELECT  "sources".* FROM "sources" WHERE "sources"."post_id" = ? LIMIT 1  [["post_id", 14]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (NULL, NULL)
DELETE FROM "sources" WHERE "sources"."id" = ?  [["id", 9]]
INSERT INTO "sources" ("post_id", "dataset_id") VALUES (?, ?)  [["post_id", 14], ["dataset_id", 10]]
---
  def update
    @post.title = params[:post][:title]
    @post.content = params[:post][:content]
    @post.image_url = params[:post][:image_url]
    @post.save
    old_sources = Source.where(post_id: @post.id).all
    old_sources.each do |source|
      source.delete
    end
    sources = params[:post][:sources]
    sources.each do |source|
      if source != ""
        @source = Source.new
        @source.post_id = @post.id
        @source.dataset_id = source.to_i
        @source.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    if not session[:user_id] or @post.user.id != session[:user_id].to_i
      redirect_to login_url
    end
    if @post
      @post.delete