app/controllers/subscriptions_controller.rb

  def create
    @subscription = Subscription.new
    @subscription.publisher_id = params[:id]
    @subscription.subscriber_id = session[:user_id]
    @subscription.save
---
INSERT INTO "subscriptions" ("publisher_id", "subscriber_id") VALUES (?, ?)  [["publisher_id", 41], ["subscriber_id", 42]]

  def index
    if not session[:user_id]
      redirect_to login_url
    end
    @subscriptions = Subscription.where(subscriber_id: session[:user_id])
    @subscriptions = @subscriptions.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."subscriber_id" = ? LIMIT 10 OFFSET 0  [["subscriber_id", 96]]
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."subscriber_id" = ?  [["subscriber_id", 96]]

  def destroy
    @sub = Subscription.find_by(id: params[:id])
    if @sub
      @sub.delete
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 9]]