app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 64]]
---
  def find_user
    @user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "users" ("name", "email", "password_digest", "description") VALUES (?, ?, ?, ?)  [["name", "alice"], ["email", "alice@example.org"], ["password_digest", "$2a$10$ecmDmEq4wb4Oag10Fi6PH.NHrVLH65IQ9W46l3vVZ/YsUgsTmeep."], ["description", "hi"]]
---
  def create
    @user = User.new
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.description = params[:user][:description]
    success = @user.save

UPDATE "users" SET "password_digest" = ?, "description" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$BoTBwxpRbY2y4jwzRJmst..xsEYLKPeZ49JUUxfmz8ftI./i3VhIy"], ["description", "4"], ["id", 48]]
---
  def update
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.description = params[:user][:description]
    success = @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 16]]
---
  def destroy
    if @user
      @user.delete